fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаЕжемесячнойАбонентскойПлаты</name>
    <type>
      <types>DefinedType.ВКМ_Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботыСпециалиста</name>
    <type>
      <types>DefinedType.ВКМ_Сумма</types>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВКМ_ПриВыбореВидаДоговора();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВКМ_ВидДоговораПриИзменении(Элемент)
	ВКМ_ПриВыбореВидаДоговора();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВКМ_ПриВыбореВидаДоговора()

	Если Объект.ВидДоговора	=
	ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда	
		ЭтоАбонентскийДоговор = Истина;
	Иначе
		ЭтоАбонентскийДоговор = Ложь;	
	КонецЕсли;
	
	Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = ЭтоАбонентскийДоговор;
	Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = ЭтоАбонентскийДоговор;
	Элементы.ВКМ_СуммаЕжемесячнойАбонентскойПлаты.Видимость = ЭтоАбонентскийДоговор;
	Элементы.ВКМ_СтоимостьЧасаРаботыСпециалиста.Видимость = ЭтоАбонентскийДоговор;
	
КонецПроцедуры

#КонецОбласти
